forge/app/controllers/setting_details_controller.rb

SELECT  "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    @campaign = Campaign.find(params[:campaign_id])