app/controllers/campaigns_controller.rb

  def show
    @campaign = Campaign.find(params[:id])
---
SELECT  "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @campaign = Campaign.new
    @campaign.user = current_user
    @campaign.title = params[:campaign][:title]
    @campaign.description = params[:campaign][:description]
    if params[:campaign][:experience_track] == '1'
      @campaign.experience_track = 'Slow'
    elsif params[:campaign][:experience_track] == '2'
      @campaign.experience_track = 'Medium'
    elsif params[:campaign][:experience_track] == '3'
      @campaign.experience_track = 'Fast'
    end

    if @campaign.save
---
INSERT INTO "campaigns" ("user_id", "title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["title", "fgh"], ["description", "dasfg"], ["created_at", "2018-08-26 14:45:25.684782"], ["updated_at", "2018-08-26 14:45:25.684782"]]